{
    "name": "Austin Jenkins",
    "title": "Senior Full Stack Web Developer",
    "address": {
        "city": "Denver",
        "state": "CO"
    },
    "links": [
        {
            "name": "LinkedIn",
            "url": "https://xyz.com"
        }
    ],
    "professionalSummary": "Highly motivated Full Stack Web Developer with over 10 years of experience in web application development. A results-driven professional, dedicated to writing clean and maintainable code that emphasizes performance and scalability. Recognized for the ability to work collaboratively with cross-functional teams across all areas of an organization, both large and small, to ensure successful project outcomes. As a passionate self-starter, is eager to apply experience and knowledge to become a valuable contributor to a growth-stage startup, driving innovation and delivering high-quality solutions.",
    "employmentHistory": [
        {
            "startDate": "Oct 2021",
            "endDate": "Present",
            "location": "Broomfield, CO",
            "company": "Vail Resorts",
            "title": "Senior Lead Front-end Engineer",
            "bullets": [
                "Spearheaded the front-end development project for the integration of three new resort sites to the Vail Resorts portfolio, utilizing ReactJS and custom CSS/LESS, to deliver a seamless and intuitive user experience.",
                "Collaborated with cross-functional teams, including product owners, management, infrastructure and QA to generate a new JavaScript Digital Data Object which could be read by multiple third party services.",
                "Implemented large-scale A/B tests across the lessons, checkout and resulting in incremental revenues in excess of millions of dollars.",
                "Refactored legacy jQuery, RequireJS and HTML templates to modern ReactJS components, leveraging React's Context API for efficient state management, resulting in a more maintainable and scalable codebase.",
                "Updated analytics platform to utilize Webpack and TypeScript from Vanilla JavaScript to enhance performance and maintainability."
            ]
        }
    ]
}